<img src="image.jpg">

# Resumen tratamiento de Data Frame

In [49]:
import pandas as pd
import numpy as np
#CREO DATASET PARA PRACTICA
df=pd.DataFrame()

df.loc[:,"Nota1"]=(1,2,3,2,9,2,5,8,7,4,3,3,1)
df.loc[:,"Nota2"]=(3,2,5,4,8,4,10,8,7,6,10,2,3)
df.loc[:,"Nota3"]=(10,10,2,3,9,6,8,9,9,10,2,1,10)
df.loc[:,"nombre"]=("luca","juan","pedro","garcia","felipe","juan","lucia","juancarlo","anieth","nanci","mati","penelope","luca")

In [50]:
df

    Nota1  Nota2  Nota3     nombre
0       1      3     10       luca
1       2      2     10       juan
2       3      5      2      pedro
3       2      4      3     garcia
4       9      8      9     felipe
5       2      4      6       juan
6       5     10      8      lucia
7       8      8      9  juancarlo
8       7      7      9     anieth
9       4      6     10      nanci
10      3     10      2       mati
11      3      2      1   penelope
12      1      3     10       luca

**Tipos de datos en el df**

In [51]:
df.dtypes.value_counts()

int64     3
object    1
dtype: int64

In [52]:
#cuantos hay de cada nombre
df.nombre.value_counts()

luca         2
juan         2
pedro        1
garcia       1
felipe       1
lucia        1
juancarlo    1
anieth       1
nanci        1
mati         1
penelope     1
Name: nombre, dtype: int64

In [53]:
#Saber cuantos datos hay de cada clase (cantidad de datos diferentes)
df['Nota2'].value_counts()
# or 
df[['Nota2','Nota3']].value_counts()
#or
df.value_counts()

Nota1  Nota2  Nota3  nombre
1      3      10     luca         2
2      2      10     juan         1
       4      3      garcia       1
              6      juan         1
3      2      1      penelope     1
       5      2      pedro        1
       10     2      mati         1
4      6      10     nanci        1
5      10     8      lucia        1
7      7      9      anieth       1
8      8      9      juancarlo    1
9      8      9      felipe       1
dtype: int64

In [38]:
df['Nota1'].value_counts()

2    3
3    3
1    2
9    1
5    1
8    1
7    1
4    1
Name: Nota1, dtype: int64

**Cuantos nulos hay en cada columna**

In [54]:
df.isnull().sum().sum()

0

In [7]:
df.isnull().sum().sum() # Numero total de nulos
np.sum(df.isnull())#Cantidad de nulos en cada columna

Nota1     0
Nota2     0
Nota3     0
nombre    0
dtype: int64

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nota1   13 non-null     int64
 1   Nota2   13 non-null     int64
 2   Nota3   13 non-null     int64
 3   nombre  13 non-null     object
dtypes: int64(3), object(1)
memory usage: 544.0+ bytes

 **Cantidad de filas y columnas**

In [9]:
df.shape

(13, 4)

In [10]:
#descripción estadística de los datos numéricos
df.describe()

           Nota1      Nota2      Nota3
count  13.000000  13.000000  13.000000
mean    3.846154   5.538462   6.846154
std     2.640901   2.846500   3.555422
min     1.000000   2.000000   1.000000
25%     2.000000   3.000000   3.000000
50%     3.000000   5.000000   9.000000
75%     5.000000   8.000000  10.000000
max     9.000000  10.000000  10.000000

**Filtrar datos segun el valor de alguna columna**

In [11]:
#muestra todas las filas que tengan en nota2 un 10
df[df.Nota2==10]

    Nota1  Nota2  Nota3 nombre
6       5     10      8  lucia
10      3     10      2   mati

In [12]:
#con varias variables (muestra solo los alumnos que aprobaron las 3 notas)(otra forma mas abajo)
df[(df.Nota1>5)&(df.Nota2>5)&(df.Nota3>5)]

   Nota1  Nota2  Nota3     nombre
4      9      8      9     felipe
7      8      8      9  juancarlo
8      7      7      9     anieth

In [13]:
#Otra forma de filtrar datos segun valor
df.query('Nota2 > 9')

    Nota1  Nota2  Nota3 nombre
6       5     10      8  lucia
10      3     10      2   mati

In [14]:
#Alumnos que se sacorn el doble de nota en el segundo parcial
df[df.Nota1 > df.Nota1*2]

Empty DataFrame
Columns: [Nota1, Nota2, Nota3, nombre]
Index: []

Flitrar por nombre del dato str.contains

In [59]:
#encontrar un valor en particular por su nombre (string)
df[df.nombre.str.contains("juan$")]

   Nota1  Nota2  Nota3 nombre
1      2      2     10   juan
5      2      4      6   juan

Saber si esta o no retorna true o false

In [60]:
df['nombre'].isin(['esteban'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
Name: nombre, dtype: bool

 Eliminar una columna por su nombre

In [17]:
df=df.drop(["Nota1"],axis=1)  
df.head(2)

   Nota2  Nota3 nombre
0      3     10   luca
1      2     10   juan

Insertar una fila a un dataframe

In [18]:
 #Creo la columna nueva que voya  incertar en el df original
Nota1=(1,2,3,2,9,2,5,8,7,4,3)
columnNew=pd.DataFrame(Nota1) # creo un dataframe (una columna)
columnNew.columns=["Nota1"] # le pongo nombre
columnNew.head(2)

   Nota1
0      1
1      2

In [19]:
#Inserto la columna
df.insert(0, 'Nota1', columnNew.Nota1)
df.head(3)

   Nota1  Nota2  Nota3 nombre
0    1.0      3     10   luca
1    2.0      2     10   juan
2    3.0      5      2  pedro

Remplazar valores de una columna

In [61]:
df['Nota1']= df['Nota1'].replace(9,0)

In [63]:
df

    Nota1  Nota2  Nota3     nombre
0       1      3     10       luca
1       2      2     10       juan
2       3      5      2      pedro
3       2      4      3     garcia
4       0      8      9     felipe
5       2      4      6       juan
6       5     10      8      lucia
7       8      8      9  juancarlo
8       7      7      9     anieth
9       4      6     10      nanci
10      3     10      2       mati
11      3      2      1   penelope
12      1      3     10       luca

In [20]:
df['Nota1']= df['Nota1'].replace(9,0)
df['Nota1']= df['Nota1'].replace(10,1)
#Pueden ser string
df['nombre']= df['nombre'].replace("luca","Juanito")
df["nombre"][0]

'Juanito'

In [21]:
#OTRA FORMA
#transformaciones de datos fáciles (debes darle el valor a todos los valores posibles)
# sino pones todos los demas te asigna Nan
level_map = {1: 'high', 2: 'medium', 3: 'low'}
df['Nota1'] = df['Nota1'].map(level_map)
df.head(5)

    Nota1  Nota2  Nota3   nombre
0    high      3     10  Juanito
1  medium      2     10     juan
2     low      5      2    pedro
3  medium      4      3   garcia
4     NaN      8      9   felipe

**Eliminar filas que esten vacias**

In [22]:
df=df.replace('', np.nan).dropna()

In [23]:
#sumar todos los valores hasta la ultima
display(df["Nota2"])#la columna normal
df["Nota2"].cumsum()#la suma

0      3
1      2
2      5
3      4
5      4
10    10
Name: Nota2, dtype: int64

0      3
1      5
2     10
3     14
5     18
10    28
Name: Nota2, dtype: int64

In [24]:
df2= df.transpose()

In [25]:
df2

             0       1      2       3       5     10
Nota1      high  medium    low  medium  medium   low
Nota2         3       2      5       4       4    10
Nota3        10      10      2       3       6     2
nombre  Juanito    juan  pedro  garcia    juan  mati

In [26]:
df.melt()

   variable    value
0     Nota1     high
1     Nota1   medium
2     Nota1      low
3     Nota1   medium
4     Nota1   medium
5     Nota1      low
6     Nota2        3
7     Nota2        2
8     Nota2        5
9     Nota2        4
10    Nota2        4
11    Nota2       10
12    Nota3       10
13    Nota3       10
14    Nota3        2
15    Nota3        3
16    Nota3        6
17    Nota3        2
18   nombre  Juanito
19   nombre     juan
20   nombre    pedro
21   nombre   garcia
22   nombre     juan
23   nombre     mati

**Aplicar RegEx directamente en dataframes**

In [66]:
#cambio luca por luquitas y le puedo poner cualquier regex
df["nombre"] = df["nombre"].replace({r'luca':'luquitas'}, regex=True)
df.head()

   Nota1  Nota2  Nota3    nombre
0      1      3     10  luquitas
1      2      2     10      juan
2      3      5      2     pedro
3      2      4      3    garcia
4      0      8      9    felipe

**Maximo y minimo de una columna**

In [28]:

display(df.Nota2.min(),df.Nota2.max())

2

10

**Ordenamiento, ver los mas grandes o mas pequeños de cada columna**

In [31]:
df.nsmallest(10,'Nota2')# menores el 10 es la cantidad
#df.nlargest(10,'Nota1') # mayores

     Nota1  Nota2  Nota3   nombre
1   medium      2     10     juan
0     high      3     10  Juanito
3   medium      4      3   garcia
5   medium      4      6     juan
2      low      5      2    pedro
10     low     10      2     mati

**Agrupar filas según los valores de una columna**

In [67]:
df.groupby('nombre').mean()

           Nota1  Nota2  Nota3
nombre
anieth       7.0    7.0    9.0
felipe       0.0    8.0    9.0
garcia       2.0    4.0    3.0
juan         2.0    3.0    8.0
juancarlo    8.0    8.0    9.0
lucia        5.0   10.0    8.0
luquitas     1.0    3.0   10.0
mati         3.0   10.0    2.0
nanci        4.0    6.0   10.0
pedro        3.0    5.0    2.0
penelope     3.0    2.0    1.0

**Filas duplicadas**

In [68]:
df.duplicated().sum()

1

In [71]:
#me quedo con las que no son duplicadas
df2=df[~df.duplicated()]
#elimino directamente lo duplicado
df=df.drop_duplicates()

In [72]:
 df.duplicated().sum()

0